# 演習１～６

[Google Colaboratoryで開く](https://colab.research.google.com/github/202408pythonciot/SQL/blob/main/Google_Colab/exercises_01_to_06.ipynb)

<a target="_blank" href="https://colab.research.google.com/github/202408pythonciot/SQL/blob/main/Google_Colab/exercises_01_to_06.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

**sqliteをロード**

In [ ]:
%reload_ext sql
%sql sqlite:///:memory:

**employeeテーブル（従業員表）**を作成

In [ ]:
%%sql
DROP TABLE IF EXISTS employee;
CREATE TABLE "employee" (
	"employee_id"	INTEGER,		-- 従業員番号
	"name"		TEXT NOT NULL,	-- 氏名
	"mail"		TEXT,		-- メールアドレス
	"hire_date"	DATE,		-- 入社日
	"salary"		INTEGER,		-- 月給
	"dept_id"	INTEGER,		-- 所属部門番号
	PRIMARY KEY("employee_id")
);
-- 従業員データ
INSERT INTO employee VALUES(1,'梅津 玲那','umedu_rena@example.com','1987-07-03',452000,2);
INSERT INTO employee VALUES(2,'米谷 朝陽','yoneya_asahi@example.com','1990-10-01',428280,3);
INSERT INTO employee VALUES(3,'古田 沙知絵','furuta_sachie@example.com','1991-02-26',425320,4);
INSERT INTO employee VALUES(4,'細川 ちえみ','hosokawa_chiemi@example.com','2002-11-25',339520,4);
INSERT INTO employee VALUES(5,'宇田川 雅紀','utagawa_masanori@example.com','2002-12-28',338860,5);
INSERT INTO employee VALUES(6,'柴山 恭子','shibayama_kyouko@example.com','2008-06-04',299160,3);
INSERT INTO employee VALUES(7,'竹下 明日','takeshita_meibi@example.com','2019-08-12',217440,5);
INSERT INTO employee VALUES(8,'下山 草太','shimoyama_souta@example.com','2021-01-02',207260,NULL);

**演習１**
employee表をすべて照会

In [ ]:
%%sql
SELECT * FROM employee;

**演習２**
employee表から、nameとdept_idを照会

In [ ]:
%%sql
SELECT name, dept_id FROM employee;

**演習３**
employee表から、employee_idの降順ですべての列を照会

In [ ]:
%%sql
SELECT * FROM employee ORDER BY employee_id DESC;

**演習４**
employee表から、salaryが400000以上であり、かつdept_idが3である行のnameを照会

In [ ]:
%%sql
SELECT name FROM employee WHERE salary >= 400000 AND dept_id = 3;

**演習５**
employee表から、salaryが250000以上349999以下である行のnameとsalaryを二通りで照会

方法１

In [ ]:
%%sql
SELECT name, salary FROM employee WHERE salary >= 250000 AND salary <= 349999;

方法２

In [ ]:
%%sql
SELECT name, salary FROM employee WHERE salary BETWEEN 250000 AND 349999;

**演習６**
employee表から、苗字が三文字である行を照会

In [ ]:
%%sql
SELECT * FROM employee WHERE name LIKE '___ %';